!*******************************************************************************************************
!*******************************************************************************************************
!******** ����ꏉ�����v���O����								********
!******** (NACA���C�O�������k��������)								********
!********					      2013.02.02  PROGRAMMED BY RYOSUKE HAYASHI ********
!********					      2014.04.15     UPDATED BY RYOSUKE HAYASHI ********
!*******************************************************************************************************
!*******************************************************************************************************
program InitialFlow_NACA
 ! ���W���[���錾 **************************************************************************************
 use Package_NACA
 use Package_FileIO
 use Package_Grid
 use Package_Flow
 use Package_ViewFlow
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �t�@�C�����ݒ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 character, parameter :: ViewFlowFile  *  8 = 'ViewFlow'
 ! ���L�萔 ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer, parameter :: nSmooth = 100					! �X���[�W���O��
 ! �����J�n ********************************************************************************************
 ! ���؎����P�[�X�I�� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 call SelectExpCase
 write(*, '(a)') "+++++ Select Exp. case complete. +++++"
 ! �����ݒ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 call InitialSetting
 write(*, '(a)') "+++++ Initial setting complete. +++++"
 ! ���g���b�N�X ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 call CalMetrics
 write(*, '(a)') "+++++ Metrics clculation complete. +++++"
 ! �������� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 call InitialCondition
 write(*, '(a)') "+++++ Initial condition complete. +++++"
 ! ���E���� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 call BoundaryCondition
 write(*, '(a)') "+++++ Boundary condition complete. +++++"
! ! �d���i�q�̕�� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
! call InterpolationOversetGrid
 write(*, '(a)') "+++++ Interpolation overset condition complete. +++++"
 ! �X���[�W���O ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 call Smoothing
 write(*, '(a)') "+++++ Smoothing complete. +++++"
 ! �t�@�C���o�� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 call OutputFile
 write(*, '(a)') "+++++ Output file complete. +++++"
 ! �������� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 call CalNondimensionalized
 write(*, '(a)') "+++++ Nondimensionalized complete. +++++"
 ! ���������t�@�C���o�� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 call OutputNDFile
 write(*, '(a)') "+++++ Output ND file complete. +++++"
 ! ���� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 call VisualizedFlow
 write(*, '(a)') "+++++ Visualized flow complete. +++++"
 ! �����葱�� ******************************************************************************************
 stop
contains
!*******************************************************************************************************
!******** ���؎����P�[�X�I�� 									********
!*******************************************************************************************************
subroutine SelectExpCase
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 character :: fname * 20
 ! �����J�n ********************************************************************************************
 ! �f�B���N�g���ݒ�
 GrdInDir    = bckdir // 'grid/clean/'
 OSGDir      = bckdir // 'overset/clean/'
 FlwIniDir   = bckdir // 'flow/initial//clean/'
 ! �v�Z�����t�@�C������
 call Input_CalSetting( trim(ND_CalSetFile) // strtxt )
 ! �����I�� ********************************************************************************************
 return
end subroutine SelectExpCase
!*******************************************************************************************************
!******** �����ݒ�										********
!*******************************************************************************************************
subroutine InitialSetting
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer :: m
 ! �����J�n ********************************************************************************************
 ! �u���b�N���ݒ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 call Set_BlockName
 ! �\���̃������m�� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
! allocate( Flw(ms:me), OSG(ms:me) )
 allocate( Flw(ms:me) )
 ! �������m�ۋy�ъi�q�t�@�C�� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
! do m = ms, me
 m = me
  ! �i�q�𑜓x -----------------------------------------------------------------------------------------
  call Input_Resolution3D( &
  &      trim(GrdInDir) // trim(BlkName(m)) // trim(RslFile), strtxt, &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke )
  ! �������m�� -----------------------------------------------------------------------------------------
  allocate( Flw(m)%x   (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%y   (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%z   (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%rho (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%u   (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%v   (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%w   (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%p   (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%t   (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%mu  (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%kin (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%eps (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%mut (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%xix (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%xiy (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%xiz (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%etx (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%ety (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%etz (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%zex (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%zey (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%zez (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%jac (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Flw(m)%qh  (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke, ls: le) )
  ! �i�q���W -------------------------------------------------------------------------------------------
  call Input_Grid3D( &
  &      trim(GrdInDir) // trim(BlkName(m)) // trim(GrdFile), strbin, &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      Flw(m)%x, Flw(m)%y, Flw(m)%z )
  ! C �^�i�q�����_ -------------------------------------------------------------------------------------
  call Input_CtypeGridPoint( &
  &      trim(GrdInDir) // trim(BlkName(m)) // trim(CtypePointFile) // strtxt, &
  &      Flw(m)%i1, Flw(m)%i2, Flw(m)%i3 )
! enddo
! ! �d���i�q��ԌW���t�@�C�� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
! do m = ms, me
!  ! ��ԒT���͈� ---------------------------------------------------------------------------------------
!  call Input_Resolution3D( &
!  &      trim(OSGDir) // trim(BlkName(m)) // trim(OverAreaFile), strtxt, &
!  &      OSG(m)%is, OSG(m)%ie, OSG(m)%js, OSG(m)%je, OSG(m)%ks, OSG(m)%ke )
!  ! �������m�� -----------------------------------------------------------------------------------------
!  allocate( OSG(m)%ip   ( OSG(m)%is: OSG(m)%ie, OSG(m)%js: OSG(m)%je, OSG(m)%ks: OSG(m)%ke ), &
!  &         OSG(m)%jp   ( OSG(m)%is: OSG(m)%ie, OSG(m)%js: OSG(m)%je, OSG(m)%ks: OSG(m)%ke ), &
!  &         OSG(m)%kp   ( OSG(m)%is: OSG(m)%ie, OSG(m)%js: OSG(m)%je, OSG(m)%ks: OSG(m)%ke ), &
!  &         OSG(m)%fOver( OSG(m)%is: OSG(m)%ie, OSG(m)%js: OSG(m)%je, OSG(m)%ks: OSG(m)%ke ), &
!  &         OSG(m)%term1( OSG(m)%is: OSG(m)%ie, OSG(m)%js: OSG(m)%je, OSG(m)%ks: OSG(m)%ke ), &
!  &         OSG(m)%term2( OSG(m)%is: OSG(m)%ie, OSG(m)%js: OSG(m)%je, OSG(m)%ks: OSG(m)%ke ), &
!  &         OSG(m)%term3( OSG(m)%is: OSG(m)%ie, OSG(m)%js: OSG(m)%je, OSG(m)%ks: OSG(m)%ke ), &
!  &         OSG(m)%term4( OSG(m)%is: OSG(m)%ie, OSG(m)%js: OSG(m)%je, OSG(m)%ks: OSG(m)%ke ), &
!  &         OSG(m)%term5( OSG(m)%is: OSG(m)%ie, OSG(m)%js: OSG(m)%je, OSG(m)%ks: OSG(m)%ke ), &
!  &         OSG(m)%term6( OSG(m)%is: OSG(m)%ie, OSG(m)%js: OSG(m)%je, OSG(m)%ks: OSG(m)%ke ), &
!  &         OSG(m)%term7( OSG(m)%is: OSG(m)%ie, OSG(m)%js: OSG(m)%je, OSG(m)%ks: OSG(m)%ke ), &
!  &         OSG(m)%term8( OSG(m)%is: OSG(m)%ie, OSG(m)%js: OSG(m)%je, OSG(m)%ks: OSG(m)%ke ) )
!  ! ��ԌW�� -------------------------------------------------------------------------------------------
!  call Input_OversetCoe3D( &
!  &      trim(OSGDir) // trim(BlkName(m)) // trim(OverCoeFile), strbin, &
!  &      OSG(m)%is, OSG(m)%ie, OSG(m)%js, OSG(m)%je, OSG(m)%ks, OSG(m)%ke, &
!  &      OSG(m)%fOver, OSG(m)%ip, OSG(m)%jp, OSG(m)%kp, &
!  &      OSG(m)%term1, OSG(m)%term2, OSG(m)%term3, OSG(m)%term4, &
!  &      OSG(m)%term5, OSG(m)%term6, OSG(m)%term7, OSG(m)%term8 )
! enddo
 ! �����I�� ********************************************************************************************
 return
end subroutine InitialSetting
!*******************************************************************************************************
!******** ���g���b�N�X�v�Z									********
!*******************************************************************************************************
subroutine CalMetrics
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer :: m
 ! �����J�n ********************************************************************************************
! do m = ms, me
 m = me
  call Metrics3D( &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      Flw(m)%x, Flw(m)%y, Flw(m)%z, &
  &      Flw(m)%xix, Flw(m)%xiy, Flw(m)%xiz, &
  &      Flw(m)%etx, Flw(m)%ety, Flw(m)%etz, &
  &      Flw(m)%zex, Flw(m)%zey, Flw(m)%zez, &
  &      Flw(m)%jac )
! enddo
 ! �����I�� ********************************************************************************************
return
end subroutine CalMetrics
!*******************************************************************************************************
!******** ���������ݒ� 										********
!*******************************************************************************************************
subroutine InitialCondition
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer :: i, j, k, m
 integer :: j0
 real    :: RhoIn, Mach
 real    :: BL
 ! �����J�n ********************************************************************************************
 ! ���������y�ї��o���� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 Mach  = VelExp / sqrt(gamma * Rg * TsExp)
 VelIn = VelExp
 RhoIn = PsExp / (Rg * TsExp)
 TtIn  = TsExp * (1.0 + 0.5 * (gamma - 1.0) * Mach**2)
 PtIn  = PsExp * (1.0 + 0.5 * (gamma - 1.0) * Mach**2)**(gamma / (gamma - 1.0))
 TsOut = TsExp
 PsOut = PsExp
 ! �������� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
! do m = ms, me
 m = me
  ! �É��C�È�
  do k = Flw(m)%ks, Flw(m)%ke
  do j = Flw(m)%js, Flw(m)%je
  do i = Flw(m)%is, Flw(m)%ie
   Flw(m)%t  (i,j,k) = TsExp
   Flw(m)%p  (i,j,k) = PsExp
  enddo
  enddo
  enddo
  ! �S���W��
  call ViscosityCoefficient3D( &
  &      muSth, TsSth, s1, &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      Flw(m)%t, Flw(m)%mu )
  ! ���x�C���x�C������
  do k = Flw(m)%ks, Flw(m)%ke
  do j = Flw(m)%js, Flw(m)%je
  do i = Flw(m)%is, Flw(m)%ie
   Flw(m)%rho(i,j,k) = PsExp / (Rg * TsExp)
   Flw(m)%u  (i,j,k) = VelExp * cos(AOA)
   Flw(m)%v  (i,j,k) = VelExp * sin(AOA)
   Flw(m)%w  (i,j,k) = 0.0
   Flw(m)%kin(i,j,k) = 1.5 * ( 0.01 * sqrt( Flw(m)%u(i,j,k)**2 &
   &                                      + Flw(m)%v(i,j,k)**2 &
   &                                      + Flw(m)%w(i,j,k)**2) )**2
   Flw(m)%eps(i,j,k) = Flw(m)%kin(i,j,k)**2 * Flw(m)%rho(i,j,k) / (Flw(m)%mu(i,j,k) * Ret)
   Flw(m)%mut(i,j,k) = Cmu * Flw(m)%rho(i,j,k) * Flw(m)%kin(i,j,k)**2 / Flw(m)%eps(i,j,k)
  enddo
  enddo
  enddo
! enddo
 ! 1/7 �摥 ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 ! ���E�w���� ------------------------------------------------------------------------------------------
 BL = 0.01 * chord
 ! ���x���z --------------------------------------------------------------------------------------------
! do m = ms, me
 m = me
  j0 = Flw(m)%js
  do k = Flw(m)%ks, Flw(m)%ke
  do j = Flw(m)%js, Flw(m)%je
  do i = Flw(m)%is, Flw(m)%ie
    if( Flw(m)%i1 <= i .and. i <= Flw(m)%i3 ) then
      Flw(m)%u(i,j,k) = Flw(m)%u(i,j,k) &
      &               * min( 1.0, ( sqrt( (Flw(m)%x(i,j,k) - Flw(m)%x(i,j0,k))**2 &
      &                                 + (Flw(m)%y(i,j,k) - Flw(m)%y(i,j0,k))**2 &
      &                                 + (Flw(m)%z(i,j,k) - Flw(m)%z(i,j0,k))**2 ) &
      &                           / BL )**(1.0 / 7.0) )
    else
      Flw(m)%u(i,j,k) = Flw(m)%u(i,j,k) &
      &               * min( 1.0, ( sqrt( (Flw(m)%x(i,j,k) - Flw(m)%x(Flw(m)%i1,j0,k))**2 &
      &                                 + (Flw(m)%y(i,j,k) - Flw(m)%y(Flw(m)%i1,j0,k))**2 &
      &                                 + (Flw(m)%z(i,j,k) - Flw(m)%z(Flw(m)%i1,j0,k))**2 ) &
      &                           / BL )**(1.0 / 7.0) )
    endif
  enddo
  enddo
  enddo
! enddo
 ! �v�Z�ʂɕϊ� ----------------------------------------------------------------------------------------
! do m = ms, me
 m = me
  call SetFlux3DKEM( &
  &      gamma, &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, ls, le, &
  &      Flw(m)%qh, Flw(m)%jac, &
  &      Flw(m)%rho, Flw(m)%u, Flw(m)%v, Flw(m)%w, Flw(m)%p, Flw(m)%kin, Flw(m)%eps )
! enddo
 ! �����I�� ********************************************************************************************
 return
end subroutine InitialCondition
!*******************************************************************************************************
!******** ���E���� 										********
!*******************************************************************************************************
subroutine BoundaryCondition
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �Ǐ��萔 ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer :: i, j, k, l, m
 ! �����J�n ********************************************************************************************
 ! Main Grid, Sub Grid +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
! do m = ms,me
 m = me
 ! �������E --------------------------------------------------------------------------------------------
 call BoundaryInlet( &
 &      m, Flw(m)%is + 1, Flw(m)%ie - 1, Flw(m)%ks + 1, Flw(m)%ke - 1, &
 &      Flw(m)%je - 0, Flw(m)%je - 1 )
 ! C �^�i�q�u�����`�E�J�b�g ----------------------------------------------------------------------------
 call BoundaryCtypeBranch( &
 &      m, Flw(m)%is + 1, Flw(m)%i1 - 1, Flw(m)%ks + 1, Flw(m)%ke - 1, &
 &      Flw(m)%js + 0, Flw(m)%js + 1, &
 &      Flw(m)%ie )
 call BoundaryCtypeBranch( &
 &      m, Flw(m)%i3 + 1, Flw(m)%ie - 1, Flw(m)%ks + 1, Flw(m)%ke - 1, &
 &      Flw(m)%js + 0, Flw(m)%js + 1, &
 &      Flw(m)%ie )
 ! ���ǖ� ----------------------------------------------------------------------------------------------
 call BoundaryBladeSurface( &
 &      m, Flw(m)%i1 + 0, Flw(m)%i3 - 0, Flw(m)%ks + 1, Flw(m)%ke - 1, &
 &      Flw(m)%js + 0, Flw(m)%js + 1, Flw(m)%js + 2, TurbNum )
 ! ���o���E --------------------------------------------------------------------------------------------
 call BoundaryOutlet( &
 &      m, Flw(m)%js + 0, Flw(m)%je - 0, Flw(m)%ks + 1, Flw(m)%ke - 1, &
 &      Flw(m)%is + 0, Flw(m)%is + 1 )
 call BoundaryOutlet( &
 &      m, Flw(m)%js + 0, Flw(m)%je - 0, Flw(m)%ks + 1, Flw(m)%ke - 1, &
 &      Flw(m)%ie - 0, Flw(m)%ie - 1 )
 ! �������E --------------------------------------------------------------------------------------------
 call BoundaryPeriodic( &
 &      m, Flw(m)%is + 0, Flw(m)%ie - 0, Flw(m)%js + 0, Flw(m)%je - 0, &
 &      Flw(m)%ks + 0, Flw(m)%ke - 1 )
 call BoundaryPeriodic( &
 &      m, Flw(m)%is + 0, Flw(m)%ie - 0, Flw(m)%js + 0, Flw(m)%je - 0, &
 &      Flw(m)%ke - 0, Flw(m)%ks + 1 )
! end do
 ! �����I�� ********************************************************************************************
 return
end subroutine BoundaryCondition
!*******************************************************************************************************
!******** �������E										********
!******** �@�D���x�O�}�C���̑��Œ�@			�A�D�p�x�E�S���E�S���Œ�C�}�b�n���O�}	********
!******** �B�D�p�x�E�̐ϗ��ʁE�S���Œ�C���x�O�}  						********
!*******************************************************************************************************
subroutine BoundaryInlet( &
&            m, is, ie, ks, ke, j0, j1 )
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �����ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer, intent(in) :: m
 integer, intent(in) :: is, ie, ks, ke
 integer, intent(in) :: j0, j1
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer :: i, k, l
 real    :: u, v, w, p, t
 real    :: Tt_Ts, Ts, Ps, mac, vel, rho, kin, eps
 ! �����J�n ********************************************************************************************
 select case(BCNum)
  case(1)
   do k = ks, ke
   do i = is, ie
    ! ���x�O�}
    rho = Flw(m)%qh(i,j1,k,1) * Flw(m)%jac(i,j1,k)
    ! ���̑��Œ�
    vel = VelIn
    u   = vel * cos(AOA)
    v   = vel * sin(AOA)
    w   = 0.0
    t   = TsExp
    kin = 0.5 * 3.0 * ( 0.01 * vel )**2
    eps = rho * kin**2 / (Flw(m)%mu(i,j0,k) * Ret)
    ! �����֐�
    Flw(m)%qh(i,j0,k,1) = rho / Flw(m)%jac(i,j0,k)
    Flw(m)%qh(i,j0,k,2) = u * Flw(m)%qh(i,j0,k,1)
    Flw(m)%qh(i,j0,k,3) = v * Flw(m)%qh(i,j0,k,1)
    Flw(m)%qh(i,j0,k,4) = w * Flw(m)%qh(i,j0,k,1)
    Flw(m)%qh(i,j0,k,5) = ( Rg * t / (gamma - 1.0) + 0.5 * vel**2 + kin ) * Flw(m)%qh(i,j0,k,1)
    Flw(m)%qh(i,j0,k,6) =  kin * Flw(m)%qh(i,j0,k,1)
    Flw(m)%qh(i,j0,k,7) =  eps * Flw(m)%qh(i,j0,k,1)
   enddo
   enddo
  case(2)
   do k = ks, ke
   do i = is, ie
    ! �O�}���鑬�x����}�b�n�����o
    u = Flw(m)%qh(i,j1,k,2) / Flw(m)%qh(i,j1,k,1)
    v = Flw(m)%qh(i,j1,k,3) / Flw(m)%qh(i,j1,k,1)
    w = Flw(m)%qh(i,j1,k,4) / Flw(m)%qh(i,j1,k,1)
    p = ( Flw(m)%qh(i,j1,k,5) - Flw(m)%qh(i,j1,k,6) &
    &     - 0.5 * ( Flw(m)%qh(i,j1,k,2)**2 &
    &             + Flw(m)%qh(i,j1,k,3)**2 &
    &             + Flw(m)%qh(i,j1,k,4)**2 ) / Flw(m)%qh(i,j1,k,1) &
    &   ) * (gamma - 1.0) * Flw(m)%jac(i,j1,k)
    t = p / (Flw(m)%qh(i,j1,k,1) * Flw(m)%jac(i,j1,k) * Rg)
    mac = sqrt( u**2 + v**2 + w**2 ) / sqrt( gamma * Rg * t )
    ! �O�}����}�b�n���ƌŒ肷��S���E�S������É��E�È����o
    Tt_Ts = 1.0 + 0.5 * (gamma - 1.0) * mac**2
    Ts = TtIn / Tt_Ts
    Ps = PtIn / Tt_Ts**( gamma / (gamma - 1.0) )
    ! ���̑����o
    rho = Ps / ( Rg * Ts )
    vel = mac * sqrt(gamma * Rg * Ts)
    u   = vel * cos(AOA)
    v   = vel * sin(AOA)
    w   = 0.0
    kin = 0.5 * 3.0 * ( 0.01 * vel )**2
    eps = rho * kin**2 / (Flw(m)%mu(i,j0,k) * Ret)
    ! �����֐�
    Flw(m)%qh(i,j0,k,1) = rho / Flw(m)%jac(i,j0,k)
    Flw(m)%qh(i,j0,k,2) = u   * Flw(m)%qh(i,j0,k,1)
    Flw(m)%qh(i,j0,k,3) = v   * Flw(m)%qh(i,j0,k,1)
    Flw(m)%qh(i,j0,k,4) = w   * Flw(m)%qh(i,j0,k,1)
    Flw(m)%qh(i,j0,k,5) = ( Rg * Ts / (gamma - 1.0) + 0.5 * vel**2 + kin ) * Flw(m)%qh(i,j0,k,1)
    Flw(m)%qh(i,j0,k,6) =  kin * Flw(m)%qh(i,j0,k,1)
    Flw(m)%qh(i,j0,k,7) =  eps * Flw(m)%qh(i,j0,k,1)
   enddo
   enddo
  case(3)
   do k = ks, ke
   do i = is, ie
    ! ���x�O�}
    rho = Flw(m)%qh(i,j1,k,1) * Flw(m)%jac(i,j1,k)
    ! �̐ϗ��ʌŒ�
    vel = VelIn
    ! �S���Œ�
    Ts  = TtIn - (gamma - 1.0) / (2.0 * gamma * Rg) * vel**2
    Ps  = rho * Rg * Ts
    ! ���x���痐���ʓ��o
    kin = 0.5 * 3.0 * ( 0.01 * vel )**2
    eps = rho * kin**2 / (Flw(m)%mu(i,j0,k) * Ret)
    ! �����֐�
    Flw(m)%qh(i,j0,k,1) = rho / Flw(m)%jac(i,j0,k)
    Flw(m)%qh(i,j0,k,2) = vel * cos(AOA) * Flw(m)%qh(i,j0,k,1)
    Flw(m)%qh(i,j0,k,3) = vel * sin(AOA) * Flw(m)%qh(i,j0,k,1)
    Flw(m)%qh(i,j0,k,4) = 0.0
    Flw(m)%qh(i,j0,k,5) = ( Rg * Ts / (gamma - 1.0) + 0.5 * vel**2 + kin ) * Flw(m)%qh(i,j0,k,1)
    Flw(m)%qh(i,j0,k,6) =  kin * Flw(m)%qh(i,j0,k,1)
    Flw(m)%qh(i,j0,k,7) =  eps * Flw(m)%qh(i,j0,k,1)
   enddo
   enddo
  case default
   write(*, '(a)') '!!!! Error : Inlet boundary condition pattern !!!!'
 end select
 ! �����I�� ********************************************************************************************
 return
end subroutine BoundaryInlet
!*******************************************************************************************************
!******** ���o���E (�È��Œ�C���̑��O�}) 							********
!*******************************************************************************************************
subroutine BoundaryOutlet( &
&            m, js, je, ks, ke, i0, i1 )
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �����ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer, intent(in) :: m
 integer, intent(in) :: js, je, ks, ke
 integer, intent(in) :: i0, i1
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer :: j, k, l
 real    :: Ts, Ps
 ! �����J�n ********************************************************************************************
 do k = ks, ke
 do j = js, je
  Ps = ( Flw(m)%qh(i1,j,k,5) - Flw(m)%qh(i1,j,k,6) &
  &      - 0.5 * ( Flw(m)%qh(i1,j,k,2)**2 &
  &              + Flw(m)%qh(i1,j,k,3)**2 &
  &              + Flw(m)%qh(i1,j,k,4)**2 ) / Flw(m)%qh(i1,j,k,1) &
  &    ) * (gamma - 1.0) * Flw(m)%jac(i1,j,k)
  Ts = Ps / (Flw(m)%qh(i1,j,k,1) * Flw(m)%jac(i1,j,k) * Rg)
  do l = ls + 1, le
   Flw(m)%qh(i0,j,k,l) = Flw(m)%qh(i1,j,k,l) / Flw(m)%qh(i1,j,k,1)
  enddo
  Flw(m)%qh(i0,j,k,1) = PsOut / ( Rg * Ts * Flw(m)%jac(i0,j,k) )
  do l = ls + 1, le
    Flw(m)%qh(i0,j,k,l) = Flw(m)%qh(i0,j,k,l) * Flw(m)%qh(i0,j,k,1)
  enddo
 enddo
 enddo
 ! �����I�� ********************************************************************************************
 return
end subroutine BoundaryOutlet
!*******************************************************************************************************
!******** C �^�i�q�u�����`�E�J�b�g���E (���ϒl�O�})                           			********
!*******************************************************************************************************
subroutine BoundaryCtypeBranch( &
&            m, is, ie, ks, ke, j0, j1, imax )
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �����ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer, intent(in) :: m
 integer, intent(in) :: is, ie, ks, ke
 integer, intent(in) :: j0, j1
 integer, intent(in) :: imax
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer :: i, k, l
 real    :: qAve
 ! �����J�n ********************************************************************************************
 do l = ls, le
 do k = ks, ke
 do i = is, ie
  qAve = 0.5 * ( Flw(m)%qh(i     ,j1,k,l) * Flw(m)%jac(i     ,j1,k) &
  &            + Flw(m)%qh(imax-i,j1,k,l) * Flw(m)%jac(imax-i,j1,k) )
  Flw(m)%qh(i,j0,k,l) = qAve / Flw(m)%jac(i,j0,k)
 enddo
 enddo
 enddo
 ! �����I�� ********************************************************************************************
 return
end subroutine BoundaryCtypeBranch
!*******************************************************************************************************
!******** ���ǖʋ��E										********
!*******************************************************************************************************
subroutine BoundaryBladeSurface( &
&            m, is, ie, ks, ke, j0, j1, j2, TurbNum )
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �����ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer, intent(in) :: m
 integer, intent(in) :: is, ie, ks, ke
 integer, intent(in) :: j0, j1, j2
 integer, intent(in) :: TurbNum
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer :: i, k
 ! �����J�n ********************************************************************************************
 do k = ks, ke
 do i = is, ie
  if(TurbNum .eq. 4) then
    call WallNoSlipLRe(m, i, j0, k, i, j1, k)
  else
    if(fSlip) then
      if( Flw(m)%qh(i,j1,k,1) <= 0.0 .or. Flw(m)%qh(i,j2,k,1) <= 0.0 ) cycle
      call WallSlipWF(m, i, j0, k, i, j1, k, i, j2, k)
    else
      if( Flw(m)%qh(i,j1,k,1) <= 0.0 ) cycle
      call WallNoSlipWF(m, i, j0, k, i, j1, k)
    endif
  endif
 enddo
 enddo
 ! �����I�� ********************************************************************************************
 return
end subroutine BoundaryBladeSurface
!*******************************************************************************************************
!******** �ǋ��E (����Ȃ�, �f�M, �Ǌ֐�)                                			********
!*******************************************************************************************************
subroutine WallNoslipWF( &
&            m, i0, j0, k0, i1, j1, k1 )
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �����ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer, intent(in) :: m
 integer, intent(in) :: i0, j0, k0
 integer, intent(in) :: i1, j1, k1
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 real :: dx, dy, dz
 real :: uc, vc, wc
 real :: yp, up, nup, kp, epsp, utau, dudy1, dudy2
 ! �����J�n ********************************************************************************************
 ! �Ǌ֐� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 ! �ǋߖT�̕��z
 dx = Flw(m)%x(i1,j1,k1) - Flw(m)%x(i0,j0,k0)
 dy = Flw(m)%y(i1,j1,k1) - Flw(m)%y(i0,j0,k0)
 dz = Flw(m)%z(i1,j1,k1) - Flw(m)%z(i0,j0,k0)
 uc = Flw(m)%qh(i1,j1,k1,2) / Flw(m)%qh(i1,j1,k1,1)
 vc = Flw(m)%qh(i1,j1,k1,3) / Flw(m)%qh(i1,j1,k1,1)
 wc = Flw(m)%qh(i1,j1,k1,4) / Flw(m)%qh(i1,j1,k1,1)
 ! �Ǌ֐�
 yp   = sqrt(dx**2 + dy**2 + dz**2)
 up   = sqrt(uc**2 + vc**2 + wc**2)
 up   = max(zero, up)
 nup  = Flw(m)%mu(i1,j1,k1) / (Flw(m)%qh(i1,j1,k1,1) * Flw(m)%jac(i1,j1,k1))
 kp   = Flw(m)%kin(i1,j1,k1)
 epsp = Flw(m)%eps(i1,j1,k1)
! call WallFunctionKEM1S( &
! &      yp, up, nup, kp, epsp, utau, dudy1, dudy2, kp, epsp )
 call WallFunctionKEM2S( &
 &      yp, up, nup, utau, dudy1, dudy2, kp, epsp )
 ! ���x ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 ! �ǖ�
 uc = 0.0
 vc = 0.0
 wc = 0.0
 ! �����֐� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 ! �ǖʂ����_��
 Flw(m)%qh(i1,j1,k1,5) = Flw(m)%qh(i1,j1,k1,5) - Flw(m)%qh(i1,j1,k1,6)
 Flw(m)%qh(i1,j1,k1,6) = Flw(m)%qh(i1,j1,k1,1) * kp
 Flw(m)%qh(i1,j1,k1,7) = Flw(m)%qh(i1,j1,k1,1) * epsp
 Flw(m)%qh(i1,j1,k1,5) = Flw(m)%qh(i1,j1,k1,5) + Flw(m)%qh(i1,j1,k1,6)
 ! �ǖ�
 Flw(m)%qh(i0,j0,k0,1) = Flw(m)%jac(i1,j1,k1) / Flw(m)%jac(i0,j0,k0) * Flw(m)%qh(i1,j1,k1,1)
 Flw(m)%qh(i0,j0,k0,2) = Flw(m)%qh(i0,j0,k0,1) * uc
 Flw(m)%qh(i0,j0,k0,3) = Flw(m)%qh(i0,j0,k0,1) * vc
 Flw(m)%qh(i0,j0,k0,4) = Flw(m)%qh(i0,j0,k0,1) * wc
 Flw(m)%qh(i0,j0,k0,5) = Flw(m)%jac(i1,j1,k1) / Flw(m)%jac(i0,j0,k0) &
 &                     * ( Flw(m)%qh(i1,j1,k1,5) &
 &                       - 0.5 * ( Flw(m)%qh(i1,j1,k1,2)**2 &
 &                               + Flw(m)%qh(i1,j1,k1,3)**2 &
 &                               + Flw(m)%qh(i1,j1,k1,4)**2 ) / Flw(m)%qh(i1,j1,k1,1) ) &
 &                     + 0.5 * ( Flw(m)%qh(i0,j0,k0,2)**2 &
 &                             + Flw(m)%qh(i0,j0,k0,3)**2 &
 &                             + Flw(m)%qh(i0,j0,k0,4)**2 ) / Flw(m)%qh(i0,j0,k0,1)
 Flw(m)%qh(i0,j0,k0,6) = Flw(m)%jac(i1,j1,k1) / Flw(m)%jac(i0,j0,k0) * Flw(m)%qh(i1,j1,k1,6)
 Flw(m)%qh(i0,j0,k0,7) = Flw(m)%jac(i1,j1,k1) / Flw(m)%jac(i0,j0,k0) * Flw(m)%qh(i1,j1,k1,7)
 ! �����I�� ********************************************************************************************
 return
end subroutine WallNoSlipWF
!*******************************************************************************************************
!******** �ǋ��E (���肠��, �f�M, �Ǌ֐�)                                			********
!*******************************************************************************************************
subroutine WallSlipWF( &
&            m, i0, j0, k0, i1, j1, k1, i2, j2, k2 )
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �����ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer, intent(in) :: m
 integer, intent(in) :: i0, j0, k0
 integer, intent(in) :: i1, j1, k1
 integer, intent(in) :: i2, j2, k2
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 real :: dx2, dy2, dz2
 real :: uc2, vc2, wc2
 real :: uc1, vc1, wc1
 real :: uc0, vc0, wc0
 real :: yp, up, nup, kp, epsp, utau, dudy1, dudy2
 ! �����J�n ********************************************************************************************
 ! �Ǌ֐� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 ! �ǋߖT�̕��z
 dx2 = Flw(m)%x(i2,j2,k2) - Flw(m)%x(i0,j0,k0)
 dy2 = Flw(m)%y(i2,j2,k2) - Flw(m)%y(i0,j0,k0)
 dz2 = Flw(m)%z(i2,j2,k2) - Flw(m)%z(i0,j0,k0)
 uc2 = Flw(m)%qh(i2,j2,k2,2) / Flw(m)%qh(i2,j2,k2,1)
 vc2 = Flw(m)%qh(i2,j2,k2,3) / Flw(m)%qh(i2,j2,k2,1)
 wc2 = Flw(m)%qh(i2,j2,k2,4) / Flw(m)%qh(i2,j2,k2,1)
 ! �Ǌ֐�
 yp   = sqrt(dx2**2 + dy2**2 + dz2**2)
 up   = sqrt(uc2**2 + vc2**2 + wc2**2)
 up   = max(zero, up)
 nup  = Flw(m)%mu(i2,j2,k2) / (Flw(m)%qh(i2,j2,k2,1) * Flw(m)%jac(i2,j2,k2))
 kp   = Flw(m)%kin(i2,j2,k2)
 epsp = Flw(m)%eps(i2,j2,k2)
! call WallFunctionKEM1S( &
! &      yp, up, nup, kp, epsp, utau, dudy1, dudy2, kp, epsp )
 call WallFunctionKEM2S( &
 &      yp, up, nup, utau, dudy1, dudy2, kp, epsp )
 ! ���x ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 ! �ǖʂ����_��
 uc1 = Flw(m)%qh(i1,j1,k1,2) / Flw(m)%qh(i1,j1,k1,1)
 vc1 = Flw(m)%qh(i1,j1,k1,3) / Flw(m)%qh(i1,j1,k1,1)
 wc1 = Flw(m)%qh(i1,j1,k1,4) / Flw(m)%qh(i1,j1,k1,1)
 yp  = sqrt( (Flw(m)%x(i2,j2,k2) - Flw(m)%x(i1,j1,k1))**2 &
 &         + (Flw(m)%y(i2,j2,k2) - Flw(m)%y(i1,j1,k1))**2 &
 &         + (Flw(m)%z(i2,j2,k2) - Flw(m)%z(i1,j1,k1))**2 )
 up  = max(zero, up - dudy1 * yp) / max(zero, sqrt(uc1**2 + vc1**2 + wc1**2))
 uc1 = uc1 * up
 vc1 = vc1 * up
 wc1 = wc1 * up
 ! �ǖ�
 uc0 = 0.0
 vc0 = 0.0
 wc0 = 0.0
 ! �����֐� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 ! �ǖʂ����_��
 Flw(m)%qh(i2,j2,k2,5) = Flw(m)%qh(i2,j2,k2,5) - Flw(m)%qh(i2,j2,k2,6)
 Flw(m)%qh(i2,j2,k2,6) = Flw(m)%qh(i2,j2,k2,1) * kp
 Flw(m)%qh(i2,j2,k2,7) = Flw(m)%qh(i2,j2,k2,1) * epsp
 Flw(m)%qh(i2,j2,k2,5) = Flw(m)%qh(i2,j2,k2,5) + Flw(m)%qh(i2,j2,k2,6)
 ! �ǖʂ����_��
 Flw(m)%qh(i1,j1,k1,5) = Flw(m)%qh(i1,j1,k1,5) &
 &                    - 0.5 * ( Flw(m)%qh(i1,j1,k1,2)**2 &
 &                            + Flw(m)%qh(i1,j1,k1,3)**2 &
 &                            + Flw(m)%qh(i1,j1,k1,4)**2 ) / Flw(m)%qh(i1,j1,k1,1) &
 &                    - Flw(m)%qh(i1,j1,k1,6)
 Flw(m)%qh(i1,j1,k1,2) = Flw(m)%qh(i1,j1,k1,1) * uc1
 Flw(m)%qh(i1,j1,k1,3) = Flw(m)%qh(i1,j1,k1,1) * vc1
 Flw(m)%qh(i1,j1,k1,4) = Flw(m)%qh(i1,j1,k1,1) * wc1
 Flw(m)%qh(i1,j1,k1,6) = Flw(m)%qh(i1,j1,k1,1) * kp
 Flw(m)%qh(i1,j1,k1,7) = Flw(m)%qh(i1,j1,k1,1) * epsp
 Flw(m)%qh(i1,j1,k1,5) = Flw(m)%qh(i1,j1,k1,5) &
 &                    + 0.5 * ( Flw(m)%qh(i1,j1,k1,2)**2 &
 &                            + Flw(m)%qh(i1,j1,k1,3)**2 &
 &                            + Flw(m)%qh(i1,j1,k1,4)**2 ) / Flw(m)%qh(i1,j1,k1,1) &
 &                    + Flw(m)%qh(i1,j1,k1,6)
 ! �ǖ�
 Flw(m)%qh(i0,j0,k0,1) = Flw(m)%jac(i1,j1,k1) / Flw(m)%jac(i0,j0,k0) * Flw(m)%qh(i1,j1,k1,1)
 Flw(m)%qh(i0,j0,k0,2) = Flw(m)%qh(i0,j0,k0,1) * uc0
 Flw(m)%qh(i0,j0,k0,3) = Flw(m)%qh(i0,j0,k0,1) * vc0
 Flw(m)%qh(i0,j0,k0,4) = Flw(m)%qh(i0,j0,k0,1) * wc0
 Flw(m)%qh(i0,j0,k0,5) = Flw(m)%jac(i1,j1,k1) / Flw(m)%jac(i0,j0,k0) * ( &
 &                      Flw(m)%qh(i1,j1,k1,5) &
 &                    - 0.5 * ( Flw(m)%qh(i1,j1,k1,2)**2 &
 &                            + Flw(m)%qh(i1,j1,k1,3)**2 &
 &                            + Flw(m)%qh(i1,j1,k1,4)**2 ) / Flw(m)%qh(i1,j1,k1,1) &
 &                    ) &
 &                    + 0.5 * ( Flw(m)%qh(i0,j0,k0,2)**2 &
 &                            + Flw(m)%qh(i0,j0,k0,3)**2 &
 &                            + Flw(m)%qh(i0,j0,k0,4)**2 ) / Flw(m)%qh(i0,j0,k0,1)
 Flw(m)%qh(i0,j0,k0,6) = Flw(m)%jac(i1,j1,k1) / Flw(m)%jac(i0,j0,k0) * Flw(m)%qh(i1,j1,k1,6)
 Flw(m)%qh(i0,j0,k0,7) = Flw(m)%jac(i1,j1,k1) / Flw(m)%jac(i0,j0,k0) * Flw(m)%qh(i1,j1,k1,7)
 ! �����I�� ********************************************************************************************
 return
end subroutine WallslipWF
!*******************************************************************************************************
!******** �ǋ��E (����Ȃ�, �f�M, �჌�C�m���Y���^AKN���f��)                  			********
!*******************************************************************************************************
subroutine WallNoslipLRe( &
&            m, i0, j0, k0, i1, j1, k1 )
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �����ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer, intent(in) :: m
 integer, intent(in) :: i0, j0, k0
 integer, intent(in) :: i1, j1, k1
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 real :: dx, dy, dz, yp
 double precision :: epsp
 real :: uc, vc, wc
 ! �����J�n ********************************************************************************************
 ! ���x ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 ! �ǖ� ------------------------------------------------------------------------------------------------
 uc = 0.0
 vc = 0.0
 wc = 0.0
 ! �����֐� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 ! �ǖʂ����_�� --------------------------------------------------------------------------------------
 dx = Flw(m)%x(i1,j1,k1) - Flw(m)%x(i0,j0,k0)
 dy = Flw(m)%y(i1,j1,k1) - Flw(m)%y(i0,j0,k0)
 dz = Flw(m)%z(i1,j1,k1) - Flw(m)%z(i0,j0,k0)
 yp   = sqrt(dx**2 + dy**2 + dz**2)
 epsp = 2.0d0 * dble(Flw(m)%mu(i1,j1,k1) * Flw(m)%kin(i1,j1,k1)) / &
 &      (dble(Flw(m)%qh(i1,j1,k1,1) * Flw(m)%jac(i1,j1,k1)) * dble(yp)**2.0)
 if(epsp .ne. epsp) then
  write(*,*) 'eps_p is diverged'
  stop
 end if
 ! epsp
 Flw(m)%qh(i1,j1,k1,7) = real(dble(Flw(m)%qh(i1,j1,k1,1)) * epsp)
 ! �ǖ� ------------------------------------------------------------------------------------------------
 ! �S�ĊO�}
 Flw(m)%qh(i0,j0,k0,1) = Flw(m)%qh(i1,j1,k1,1) * Flw(m)%jac(i1,j1,k1) / Flw(m)%jac(i0,j0,k0)
 Flw(m)%qh(i0,j0,k0,2) = uc * Flw(m)%qh(i0,j0,k0,1)
 Flw(m)%qh(i0,j0,k0,3) = vc * Flw(m)%qh(i0,j0,k0,1)
 Flw(m)%qh(i0,j0,k0,4) = wc * Flw(m)%qh(i0,j0,k0,1)
 Flw(m)%qh(i0,j0,k0,5) = Flw(m)%jac(i1,j1,k1) / Flw(m)%jac(i0,j0,k0) &
 &                     * ( Flw(m)%qh(i1,j1,k1,5) &
 &                       - 0.5 * ( Flw(m)%qh(i1,j1,k1,2)**2 &
 &                               + Flw(m)%qh(i1,j1,k1,3)**2 &
 &                               + Flw(m)%qh(i1,j1,k1,4)**2 ) / Flw(m)%qh(i1,j1,k1,1) ) &
 &                     + 0.5 * ( Flw(m)%qh(i0,j0,k0,2)**2 &
 &                             + Flw(m)%qh(i0,j0,k0,3)**2 &
 &                             + Flw(m)%qh(i0,j0,k0,4)**2 ) / Flw(m)%qh(i0,j0,k0,1)
 Flw(m)%qh(i0,j0,k0,6) = 0.0
 Flw(m)%qh(i0,j0,k0,7) = Flw(m)%qh(i1,j1,k1,7) * Flw(m)%jac(i1,j1,k1) / Flw(m)%jac(i0,j0,k0)
 ! �����I�� ********************************************************************************************
 return
end subroutine WallNoSlipLRe
!*******************************************************************************************************
!******** �������E                 				                                 *******
!*******************************************************************************************************
subroutine BoundaryPeriodic( &
&            m, is, ie, js, je, k0, k1 )
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �����ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer, intent(in) :: m
 integer, intent(in) :: is, ie, js, je
 integer, intent(in) :: k0, k1
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer :: i, j, l
 ! �����J�n ********************************************************************************************
 do l = ls, le
 do j = js, je
 do i = is, ie
  Flw(m)%qh(i,j,k0,l) = Flw(m)%qh(i,j,k1,l) * Flw(m)%jac(i,j,k1) / Flw(m)%jac(i,j,k0)
 enddo
 enddo
 enddo
 ! �����I�� ********************************************************************************************
 return
end subroutine BoundaryPeriodic
!*******************************************************************************************************
!******** �d���i�q�̕��									********
!*******************************************************************************************************
subroutine InterpolationOversetGrid
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer :: i, j, k, l, m, n
 integer :: i0, j0, k0, &
 &          i1, j1, k1, i2, j2, k2, i3, j3, k3, i4, j4, k4, &
 &          i5, j5, k5, i6, j6, k6, i7, j7, k7, i8, j8, k8
 ! �����J�n ********************************************************************************************
 do m = ms, me
  select case(m)
   case(1); n = 2
   case(2); n = 1
  end select
!$OMP PARALLEL DO DEFAULT(SHARED) PRIVATE(i, j, k, l, i0, j0, k0, &
!$OMP&  i1, j1, k1, i2, j2, k2, i3, j3, k3, i4, j4, k4, &
!$OMP&  i5, j5, k5, i6, j6, k6, i7, j7, k7, i8, j8, k8)

  do k0 = OSG(m)%ks, OSG(m)%ke
  do j0 = OSG(m)%js, OSG(m)%je
  do i0 = OSG(m)%is, OSG(m)%ie
   i = OSG(m)%ip(i0,j0,k0); j = OSG(m)%jp(i0,j0,k0); k = OSG(m)%kp(i0,j0,k0)
   select case( OSG(m)%fOver(i0,j0,k0) )
    ! ��Ԃ��Ȃ��_ -------------------------------------------------------------------------------------
    case(0)
     cycle
    ! �O�d���`��ԓ_ -----------------------------------------------------------------------------------
    case(1)
     i1 = i    ; j1 = j    ; k1 = k    ; i2 = i + 1; j2 = j    ; k2 = k    
     i3 = i    ; j3 = j + 1; k3 = k    ; i4 = i + 1; j4 = j + 1; k4 = k    
     i5 = i    ; j5 = j    ; k5 = k + 1; i6 = i + 1; j6 = j    ; k6 = k + 1
     i7 = i    ; j7 = j + 1; k7 = k + 1; i8 = i + 1; j8 = j + 1; k8 = k + 1
     do l = ls, le
      Flw(m)%qh(i0,j0,k0,l) = ( OSG(m)%term1(i0,j0,k0) * Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) &
      &                       + OSG(m)%term2(i0,j0,k0) * Flw(n)%qh(i2,j2,k2,l) * Flw(n)%jac(i2,j2,k2) &
      &                       + OSG(m)%term3(i0,j0,k0) * Flw(n)%qh(i3,j3,k3,l) * Flw(n)%jac(i3,j3,k3) &
      &                       + OSG(m)%term4(i0,j0,k0) * Flw(n)%qh(i4,j4,k4,l) * Flw(n)%jac(i4,j4,k4) &
      &                       + OSG(m)%term5(i0,j0,k0) * Flw(n)%qh(i5,j5,k5,l) * Flw(n)%jac(i5,j5,k5) &
      &                       + OSG(m)%term6(i0,j0,k0) * Flw(n)%qh(i6,j6,k6,l) * Flw(n)%jac(i6,j6,k6) &
      &                       + OSG(m)%term7(i0,j0,k0) * Flw(n)%qh(i7,j7,k7,l) * Flw(n)%jac(i7,j7,k7) &
      &                       + OSG(m)%term8(i0,j0,k0) * Flw(n)%qh(i8,j8,k8,l) * Flw(n)%jac(i8,j8,k8) &
      &                         ) / Flw(m)%jac(i0,j0,k0)
     enddo
    ! �O�������`��ԓ_ ---------------------------------------------------------------------------------
    case(2)
     i1 = i    ; j1 = j    ; k1 = k    ; i2 = i    ; j2 = j    ; k2 = k + 1
     i3 = i + 1; j3 = j    ; k3 = k + 1; i4 = i    ; j4 = j + 1; k4 = k + 1
     do l = ls, le
      Flw(m)%qh(i0,j0,k0,l) = ( OSG(m)%term1(i0,j0,k0) * Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) &
      &                       + OSG(m)%term2(i0,j0,k0) &
      &                         * ( Flw(n)%qh(i2,j2,k2,l) * Flw(n)%jac(i2,j2,k2) &
      &                           - Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) ) &
      &                       + OSG(m)%term3(i0,j0,k0) &
      &                         * ( Flw(n)%qh(i3,j3,k3,l) * Flw(n)%jac(i3,j3,k3) &
      &                           - Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) ) &
      &                       + OSG(m)%term4(i0,j0,k0) &
      &                         * ( Flw(n)%qh(i4,j4,k4,l) * Flw(n)%jac(i4,j4,k4) &
      &                           - Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) ) &
      &                         ) / Flw(m)%jac(i0,j0,k0)
     enddo
    case(3)
     i1 = i    ; j1 = j    ; k1 = k    ; i2 = i    ; j2 = j + 1; k2 = k    
     i3 = i + 1; j3 = j + 1; k3 = k    ; i4 = i    ; j4 = j + 1; k4 = k + 1
     do l = ls, le
      Flw(m)%qh(i0,j0,k0,l) = ( OSG(m)%term1(i0,j0,k0) * Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) &
      &                       + OSG(m)%term2(i0,j0,k0) &
      &                         * ( Flw(n)%qh(i2,j2,k2,l) * Flw(n)%jac(i2,j2,k2) &
      &                           - Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) ) &
      &                       + OSG(m)%term3(i0,j0,k0) &
      &                         * ( Flw(n)%qh(i3,j3,k3,l) * Flw(n)%jac(i3,j3,k3) &
      &                           - Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) ) &
      &                       + OSG(m)%term4(i0,j0,k0) &
      &                         * ( Flw(n)%qh(i4,j4,k4,l) * Flw(n)%jac(i4,j4,k4) &
      &                           - Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) ) &
      &                         ) / Flw(m)%jac(i0,j0,k0)
     enddo
    case(4)
     i1 = i    ; j1 = j    ; k1 = k    ; i2 = i + 1; j2 = j + 1; k2 = k    
     i3 = i + 1; j3 = j    ; k3 = k + 1; i4 = i    ; j4 = j + 1; k4 = k + 1
     do l = ls, le
      Flw(m)%qh(i0,j0,k0,l) = ( OSG(m)%term1(i0,j0,k0) * Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) &
      &                       + OSG(m)%term2(i0,j0,k0) &
      &                         * ( Flw(n)%qh(i2,j2,k2,l) * Flw(n)%jac(i2,j2,k2) &
      &                           - Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) ) &
      &                       + OSG(m)%term3(i0,j0,k0) &
      &                         * ( Flw(n)%qh(i3,j3,k3,l) * Flw(n)%jac(i3,j3,k3) &
      &                           - Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) ) &
      &                       + OSG(m)%term4(i0,j0,k0) &
      &                         * ( Flw(n)%qh(i4,j4,k4,l) * Flw(n)%jac(i4,j4,k4) &
      &                           - Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) ) &
      &                         ) / Flw(m)%jac(i0,j0,k0)
     enddo
    case(5)
     i1 = i    ; j1 = j    ; k1 = k    ; i2 = i + 1; j2 = j    ; k2 = k    
     i3 = i + 1; j3 = j + 1; k3 = k    ; i4 = i + 1; j4 = j    ; k4 = k + 1
     do l = ls, le
      Flw(m)%qh(i0,j0,k0,l) = ( OSG(m)%term1(i0,j0,k0) * Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) &
      &                       + OSG(m)%term2(i0,j0,k0) &
      &                         * ( Flw(n)%qh(i2,j2,k2,l) * Flw(n)%jac(i2,j2,k2) &
      &                           - Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) ) &
      &                       + OSG(m)%term3(i0,j0,k0) &
      &                         * ( Flw(n)%qh(i3,j3,k3,l) * Flw(n)%jac(i3,j3,k3) &
      &                           - Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) ) &
      &                       + OSG(m)%term4(i0,j0,k0) &
      &                         * ( Flw(n)%qh(i4,j4,k4,l) * Flw(n)%jac(i4,j4,k4) &
      &                           - Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) ) &
      &                         ) / Flw(m)%jac(i0,j0,k0)
     enddo
    case(6)
     i1 = i + 1; j1 = j + 1; k1 = k    ; i2 = i + 1; j2 = j    ; k2 = k + 1
     i3 = i    ; j3 = j + 1; k3 = k + 1; i4 = i + 1; j4 = j + 1; k4 = k + 1
     do l = ls, le
      Flw(m)%qh(i0,j0,k0,l) = ( OSG(m)%term1(i0,j0,k0) * Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) &
      &                       + OSG(m)%term2(i0,j0,k0) &
      &                         * ( Flw(n)%qh(i2,j2,k2,l) * Flw(n)%jac(i2,j2,k2) &
      &                           - Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) ) &
      &                       + OSG(m)%term3(i0,j0,k0) &
      &                         * ( Flw(n)%qh(i3,j3,k3,l) * Flw(n)%jac(i3,j3,k3) &
      &                           - Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) ) &
      &                       + OSG(m)%term4(i0,j0,k0) &
      &                         * ( Flw(n)%qh(i4,j4,k4,l) * Flw(n)%jac(i4,j4,k4) &
      &                           - Flw(n)%qh(i1,j1,k1,l) * Flw(n)%jac(i1,j1,k1) ) &
      &                         ) / Flw(m)%jac(i0,j0,k0)
     enddo
   end select
  enddo
  enddo
  enddo
  !$OMP END PARALLEL DO

 enddo
 ! �����I�� ********************************************************************************************
 return
end subroutine InterpolationOversetGrid
!*******************************************************************************************************
!******** �X���[�W���O										********
!*******************************************************************************************************
subroutine Smoothing
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer :: m, n
 ! �����J�n ********************************************************************************************
 do n  = 1, nSmooth
!  do m = ms, me
  m = me
   call SmoothingFlux3D( &
   &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, ls, le, &
   &      Flw(m)%jac, Flw(m)%qh )
!  enddo
!  call InterpolationOversetGrid
 enddo
 ! �����I�� ********************************************************************************************
 return
end subroutine Smoothing
!*******************************************************************************************************
!******** �t�@�C���o��										********
!*******************************************************************************************************
subroutine OutputFile
 ! �ϐ���` ********************************************************************************************
 implicit none
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer :: m
 ! �����J�n ********************************************************************************************
 ! �v�Z���� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 call Output_CalSetting( trim(CalSetFile) // strtxt )
 ! ���g���b�N�X ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
! do m = ms, me
 m = me
  call Output_Metrics3D( &
  &      trim(FlwIniDir) // trim(BlkName(m)) // trim(MetFile), strbin, &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      Flw(m)%jac, &
  &      Flw(m)%xix, Flw(m)%xiy, Flw(m)%xiz, &
  &      Flw(m)%etx, Flw(m)%ety, Flw(m)%etz, &
  &      Flw(m)%zex, Flw(m)%zey, Flw(m)%zez )
! enddo
 ! �����֐� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
! do m = ms, me
 m = me
  call Output_Flux3D( &
  &      trim(FlwIniDir) // trim(BlkName(m)) // trim(IniFlxFile), strbin, &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      ls, le, Flw(m)%qh )
! enddo
 ! �����I�� ********************************************************************************************
 return
end subroutine OutputFile
!*******************************************************************************************************
!******** ��������										********
!*******************************************************************************************************
subroutine CalNondimensionalized
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer :: j, k, m
 ! �����J�n ********************************************************************************************
 ! ���������Q�ƒl ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
! m = 1
 m = me
 aRef   = sqrt( gamma * Rg * maxval(Flw(m)%t(:,:,:)) )
 LRef   = maxval( sqrt( Flw(m)%x(:,:,:)**2 + Flw(m)%y(:,:,:)**2  + Flw(m)%z(:,:,:)**2 ) )
 RhoRef = maxval(Flw(m)%rho(:,:,:))
 ! �������� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
! do m = ms, me
 m = me
  ! ���W�n ---------------------------------------------------------------------------------------------
  call NondimensionalizedCoord3D( &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      Flw(m)%x, Flw(m)%y, Flw(m)%z )
  ! ������ ---------------------------------------------------------------------------------------------
  call SetPhysics3DKEM( &
  &      Rg, gamma, &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, ls, le, &
  &      Flw(m)%qh, Flw(m)%jac, &
  &      Flw(m)%rho, Flw(m)%u, Flw(m)%v, Flw(m)%w, Flw(m)%p, Flw(m)%t, Flw(m)%kin, Flw(m)%eps )
  call ViscosityCoefficient3D( &
  &      muSth, TsSth, s1, &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      Flw(m)%t, Flw(m)%mu )
  call EddyViscosityCoefficient3D( &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      Flw(m)%rho, Flw(m)%kin, Flw(m)%eps, cmu, Flw(m)%mut )
  call NondimensionalizedPhysics3D( &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      Flw(m)%rho, Flw(m)%u, Flw(m)%v, Flw(m)%w, Flw(m)%p, Flw(m)%t, Flw(m)%mu, &
  &      Flw(m)%kin, Flw(m)%eps, Flw(m)%mut )
  ! ���g���b�N�X ---------------------------------------------------------------------------------------
  call Metrics3D( &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      Flw(m)%x, Flw(m)%y, Flw(m)%z, &
  &      Flw(m)%xix, Flw(m)%xiy, Flw(m)%xiz, &
  &      Flw(m)%etx, Flw(m)%ety, Flw(m)%etz, &
  &      Flw(m)%zex, Flw(m)%zey, Flw(m)%zez, &
  &      Flw(m)%jac )
  ! �����֐� -------------------------------------------------------------------------------------------
  call SetFlux3DKEM( &
  &      gamma, &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, ls, le, &
  &      Flw(m)%qh, Flw(m)%jac, &
  &      Flw(m)%rho, Flw(m)%u, Flw(m)%v, Flw(m)%w, Flw(m)%p, Flw(m)%kin, Flw(m)%eps )
! enddo
 ! �T�U�[�����h�̎��̒萔 ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 s1    = s1 / aRef**2
 muSth = muSth / (RhoRef * aRef * lRef)
 TsSth = TsSth / aRef**2
 ! �������� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 VelIn  = VelIn / aRef
 PtIn   = PtIn / (rhoRef * aRef**2)
 TtIn   = TtIn / aRef**2
 PsOut  = PsOut / (rhoRef * aRef**2)
 TsOut  = TsOut / aRef**2
 LWC    = LWC  / RhoRef
 MVD    = MVD  / LRef
 RhoD   = RhoD / RhoRef
 SigD   = SigD / (rhoRef * aRef**2 * lRef)
 muD    = muD / (RhoRef * aRef * lRef)
 Span   = Span / LRef
 Chord  = Chord / LRef
 VelExp = VelExp / aRef
 PsExp  = PsExp / (rhoRef * aRef**2)
 TsExp  = TsExp / aRef**2
 ! �����I�� ********************************************************************************************
 return
end subroutine CalNondimensionalized
!*******************************************************************************************************
!******** ���������t�@�C���o��									********
!*******************************************************************************************************
subroutine OutputNDFile
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 integer :: m
 ! �����J�n ********************************************************************************************
 ! �v�Z���� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 call Output_CalSetting( trim(ND_CalSetFile) // strtxt )
 ! �i�q���W ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
! do m = ms, me
 m = me
  call Output_Grid3D( &
  &      trim(FlwIniDir) // trim(BlkName(m)) // trim(ND_GrdFile), strbin, &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      Flw(m)%x, Flw(m)%y, Flw(m)%z )
! enddo
 ! ���g���b�N�X ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
! do m = ms, me
 m = me
  call Output_Metrics3D( &
  &      trim(FlwIniDir) // trim(BlkName(m)) // trim(ND_MetFile), strbin, &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      Flw(m)%jac, &
  &      Flw(m)%xix, Flw(m)%xiy, Flw(m)%xiz, &
  &      Flw(m)%etx, Flw(m)%ety, Flw(m)%etz, &
  &      Flw(m)%zex, Flw(m)%zey, Flw(m)%zez )
! enddo
 ! �����֐� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
! do m = ms, me
 m = me
  call Output_Flux3D( &
  &      trim(FlwIniDir) // trim(BlkName(m)) // trim(ND_IniFlxFile), strbin, &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      ls, le, Flw(m)%qh )
! enddo
 ! �����I�� ********************************************************************************************
 return
end subroutine OutputNDFile
!*******************************************************************************************************
!******** ����										********
!*******************************************************************************************************
subroutine VisualizedFlow
 ! �ϐ��錾 ********************************************************************************************
 implicit none
 ! �Ǐ��ϐ� ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 real   , pointer :: mach(:, :, :), Pt(:, :, :), Tt(:, :, :)
 integer :: m
 ! �����J�n ********************************************************************************************
! do m = ms, me
 m = me
  ! �����ʂɕϊ�
  call SetPhysics3DKEM( &
  &      Rg, gamma, &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, ls, le, &
  &      Flw(m)%qh, Flw(m)%jac, &
  &      Flw(m)%rho, Flw(m)%u, Flw(m)%v, Flw(m)%w, Flw(m)%p, Flw(m)%t, Flw(m)%kin, Flw(m)%eps )
  ! �S���W��
  call ViscosityCoefficient3D( &
  &      muSth, TsSth, s1, Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      Flw(m)%t, Flw(m)%mu )
  ! �Q�S���W��
  call EddyViscosityCoefficient3D( &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      Flw(m)%rho, Flw(m)%kin, Flw(m)%eps, cmu, Flw(m)%mut )
  ! �}�b�n���C�S���C�S��
  allocate( mach(Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Pt  (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke), &
  &         Tt  (Flw(m)%is: Flw(m)%ie, Flw(m)%js: Flw(m)%je, Flw(m)%ks: Flw(m)%ke) )
  call CalMachTtPt3D( &
  &      Rg, gamma, Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      Flw(m)%u, Flw(m)%v, Flw(m)%w, Flw(m)%p, Flw(m)%t, &
  &      mach, Pt, Tt )
  ! MicroAVS�t�@�C��
  call MakeMAVSFile3D( &
  &      trim(FlwIniDir), trim(BlkName(m)) // trim(ViewFlowFile), strbin, &
  &      Flw(m)%is, Flw(m)%ie, Flw(m)%js, Flw(m)%je, Flw(m)%ks, Flw(m)%ke, &
  &      rhoRef, aRef, lRef, &
  &      Flw(m)%rho, Flw(m)%u, Flw(m)%v, Flw(m)%w, Flw(m)%p, Flw(m)%t, Flw(m)%mu, &
  &      Flw(m)%kin, Flw(m)%eps, Flw(m)%mut, mach, Pt, Tt, &
  &      Flw(m)%x, Flw(m)%y, Flw(m)%z )
  deallocate( mach, Pt, Tt )
! enddo
 ! �����I�� ********************************************************************************************
 return
end subroutine VisualizedFlow
! ��`�I�� *********************************************************************************************
end program InitialFlow_NACA
